{
  "catalog": {
    "uuid": "2ab6a7bf-c574-4cad-9fed-c843d97f35b4",
    "metadata": {
      "title": "NIST SP 800-53 Revision 5 Security Controls (Sample)",
      "last-modified": "2025-05-16T19:50:54.032Z",
      "version": "5.0",
      "oscal-version": "1.1.0"
    },
    "groups": [
      {
        "id": "ac",
        "title": "Access Control",
        "controls": [
          {
            "id": "ac-1",
            "title": "Policy and Procedures",
            "props": [
              {
                "name": "label",
                "value": "AC-1"
              }
            ],
            "parts": [
              {
                "id": "ac-1_smt",
                "name": "statement",
                "prose": "a. Develop, document, and disseminate to [Assignment: organization-defined personnel or roles] an access control policy that: 1. Addresses purpose, scope, roles, responsibilities, management commitment, coordination among organizational entities, and compliance; and 2. Is consistent with applicable laws, executive orders, directives, regulations, policies, standards, and guidelines; and b. Develop, document, and disseminate to [Assignment: organization-defined personnel or roles]: 1. Procedures to facilitate the implementation of the access control policy and the associated access controls; and 2. Review and update the current access control: (a) Policy [Assignment: organization-defined frequency]; and (b) Procedures [Assignment: organization-defined frequency]."
              }
            ]
          },
          {
            "id": "ac-2",
            "title": "Account Management",
            "props": [
              {
                "name": "label",
                "value": "AC-2"
              }
            ],
            "parts": [
              {
                "id": "ac-2_smt",
                "name": "statement",
                "prose": "a. Define and document the types of accounts allowed and specifically prohibited for use within the system; b. Assign account managers; c. Require [Assignment: organization-defined prerequisites and criteria] for group and role membership; d. Specify: 1. Authorized users of the system; 2. Group and role membership; and 3. Access authorizations (i.e., privileges) and [Assignment: organization-defined attributes (as required)] for each account; e. Require approvals by [Assignment: organization-defined personnel or roles] for requests to create accounts; f. Create, enable, modify, disable, and remove accounts in accordance with [Assignment: organization-defined policy, procedures, prerequisites, and criteria]; g. Monitor the use of accounts; h. Notify account managers and [Assignment: organization-defined personnel or roles] within: 1. [Assignment: organization-defined time period] when accounts are no longer required; 2. [Assignment: organization-defined time period] when users are terminated or transferred; and 3. [Assignment: organization-defined time period] when system usage or need-to-know changes for an individual; i. Authorize access to the system based on: 1. A valid access authorization; 2. Intended system usage; and 3. [Assignment: organization-defined attributes (as required)]; j. Review accounts for compliance with account management requirements [Assignment: organization-defined frequency]; k. Establish and implement a process for changing shared or group account authenticators (if deployed) when individuals are removed from the group; and l. Align account management processes with personnel termination and transfer processes."
              }
            ]
          }
        ]
      },
      {
        "id": "si",
        "title": "System and Information Integrity",
        "controls": [
          {
            "id": "si-4",
            "title": "System Monitoring",
            "props": [
              {
                "name": "label",
                "value": "SI-4"
              }
            ],
            "parts": [
              {
                "id": "si-4_smt",
                "name": "statement",
                "prose": "a. Monitor the system to detect: 1. Attacks and indicators of potential attacks in accordance with [Assignment: organization-defined monitoring objectives]; and 2. Unauthorized local, network, and remote connections; b. Identify unauthorized use of the system through [Assignment: organization-defined techniques and methods]; c. Invoke internal monitoring capabilities or deploy monitoring devices: 1. Strategically within the system to collect organization-determined essential information; and 2. At ad hoc locations within the system to track specific types of transactions of interest to the organization; d. Analyze detected events and anomalies; e. Adjust the level of system monitoring activity when there is a change in risk to organizational operations and assets, individuals, other organizations, or the Nation; f. Obtain legal opinion regarding system monitoring activities; and g. Provide [Assignment: organization-defined system monitoring information] to [Assignment: organization-defined personnel or roles] [Selection (one or more): as needed; [Assignment: organization-defined frequency]]."
              }
            ]
          }
        ]
      }
    ]
  }
}